wrk/output/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 3742.373ms, rate sampling interval: 12845ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.09s     3.53s   20.66s    61.40%
    Req/Sec     3.04k     0.00     3.04k     0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.57s 
 75.000%   16.94s 
 90.000%   18.68s 
 99.000%   20.35s 
 99.900%   20.64s 
 99.990%   20.68s 
 99.999%   20.68s 
100.000%   20.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6914.047     0.000000            2         1.00
    8724.479     0.100000         6243         1.11
   10575.871     0.200000        12524         1.25
   12107.775     0.300000        18726         1.43
   13238.271     0.400000        25053         1.67
   14573.567     0.500000        31204         2.00
   14974.975     0.550000        34318         2.22
   15245.311     0.600000        37488         2.50
   16039.935     0.650000        40520         2.86
   16408.575     0.700000        43705         3.33
   16941.055     0.750000        46767         4.00
   17219.583     0.775000        48398         4.44
   17547.263     0.800000        49895         5.00
   17743.871     0.825000        51531         5.71
   17891.327     0.850000        53146         6.67
   18317.311     0.875000        54630         8.00
   18415.615     0.887500        55366         8.89
   18677.759     0.900000        56276        10.00
   18874.367     0.912500        56900        11.43
   19103.743     0.925000        57808        13.33
   19234.815     0.937500        58495        16.00
   19398.655     0.943750        58834        17.78
   19431.423     0.950000        59298        20.00
   19595.263     0.956250        59629        22.86
   19660.799     0.962500        60005        26.67
   19726.335     0.968750        60398        32.00
   19759.103     0.971875        60606        35.56
   19857.407     0.975000        60780        40.00
   19988.479     0.978125        60984        45.71
   20103.167     0.981250        61305        53.33
   20152.319     0.984375        61378        64.00
   20217.855     0.985938        61483        71.11
   20267.007     0.987500        61558        80.00
   20299.775     0.989062        61654        91.43
   20365.311     0.990625        61756       106.67
   20430.847     0.992188        61858       128.00
   20463.615     0.992969        61908       142.22
   20496.383     0.993750        61957       160.00
   20529.151     0.994531        62007       182.86
   20561.919     0.995313        62058       213.33
   20594.687     0.996094        62114       256.00
   20611.071     0.996484        62137       284.44
   20627.455     0.996875        62265       320.00
   20627.455     0.997266        62265       365.71
   20627.455     0.997656        62265       426.67
   20627.455     0.998047        62265       512.00
   20627.455     0.998242        62265       568.89
   20627.455     0.998437        62265       640.00
   20627.455     0.998633        62265       731.43
   20627.455     0.998828        62265       853.33
   20643.839     0.999023        62295      1024.00
   20643.839     0.999121        62295      1137.78
   20643.839     0.999219        62295      1280.00
   20643.839     0.999316        62295      1462.86
   20660.223     0.999414        62322      1706.67
   20660.223     0.999512        62322      2048.00
   20660.223     0.999561        62322      2275.56
   20660.223     0.999609        62322      2560.00
   20660.223     0.999658        62322      2925.71
   20660.223     0.999707        62322      3413.33
   20660.223     0.999756        62322      4096.00
   20660.223     0.999780        62322      4551.11
   20676.607     0.999805        62335      5120.00
   20676.607     1.000000        62335          inf
#[Mean    =    14086.536, StdDeviation   =     3532.713]
#[Max     =    20660.224, Total count    =        62335]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  93282 requests in 30.00s, 6.47MB read
Requests/sec:   3109.46
Transfer/sec:    220.98KB