wrk/output/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 2473.618ms, rate sampling interval: 9306ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.91s     3.57s   17.55s    55.31%
    Req/Sec     3.71k   357.00     4.06k    50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.94s 
 75.000%   15.03s 
 90.000%   16.46s 
 99.000%   17.48s 
 99.900%   17.55s 
 99.990%   17.56s 
 99.999%   17.56s 
100.000%   17.56s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5091.327     0.000000           41         1.00
    6774.783     0.100000         7536         1.11
    7991.295     0.200000        15088         1.25
   10092.543     0.300000        22597         1.43
   11116.543     0.400000        30182         1.67
   11943.935     0.500000        37749         2.00
   12517.375     0.550000        41461         2.22
   13049.855     0.600000        45322         2.50
   14073.855     0.650000        49023         2.86
   14589.951     0.700000        52815         3.33
   15032.319     0.750000        56549         4.00
   15581.183     0.775000        58437         4.44
   15777.791     0.800000        60456         5.00
   15826.943     0.825000        62160         5.71
   15876.095     0.850000        64013         6.67
   16228.351     0.875000        65877         8.00
   16408.575     0.887500        66833         8.89
   16457.727     0.900000        67970        10.00
   16621.567     0.912500        68694        11.43
   16973.823     0.925000        69751        13.33
   17121.279     0.937500        70575        16.00
   17186.815     0.943750        71099        17.78
   17235.967     0.950000        71522        20.00
   17334.271     0.956250        72158        22.86
   17367.039     0.962500        72754        26.67
   17383.423     0.968750        73057        32.00
   17399.807     0.971875        73405        35.56
   17399.807     0.975000        73405        40.00
   17416.191     0.978125        73716        45.71
   17432.575     0.981250        74086        53.33
   17448.959     0.984375        74274        64.00
   17448.959     0.985938        74274        71.11
   17465.343     0.987500        74367        80.00
   17481.727     0.989062        74668        91.43
   17481.727     0.990625        74668       106.67
   17498.111     0.992188        74718       128.00
   17514.495     0.992969        74785       142.22
   17530.879     0.993750        75059       160.00
   17530.879     0.994531        75059       182.86
   17530.879     0.995313        75059       213.33
   17530.879     0.996094        75059       256.00
   17530.879     0.996484        75059       284.44
   17530.879     0.996875        75059       320.00
   17547.263     0.997266        75249       365.71
   17547.263     0.997656        75249       426.67
   17547.263     0.998047        75249       512.00
   17547.263     0.998242        75249       568.89
   17547.263     0.998437        75249       640.00
   17547.263     0.998633        75249       731.43
   17547.263     0.998828        75249       853.33
   17547.263     0.999023        75249      1024.00
   17547.263     0.999121        75249      1137.78
   17547.263     0.999219        75249      1280.00
   17547.263     0.999316        75249      1462.86
   17547.263     0.999414        75249      1706.67
   17547.263     0.999512        75249      2048.00
   17547.263     0.999561        75249      2275.56
   17547.263     0.999609        75249      2560.00
   17563.647     0.999658        75278      2925.71
   17563.647     1.000000        75278          inf
#[Mean    =    11913.531, StdDeviation   =     3574.652]
#[Max     =    17547.264, Total count    =        75278]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  124440 requests in 30.00s, 8.07MB read
Requests/sec:   4148.20
Transfer/sec:    275.47KB