wrk/output/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 450.275ms, rate sampling interval: 1224ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.48ms  103.52ms 368.13ms   84.46%
    Req/Sec    10.19k   404.96    11.38k    81.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.61ms
 75.000%   33.98ms
 90.000%  287.49ms
 99.000%  355.07ms
 99.900%  366.08ms
 99.990%  368.13ms
 99.999%  368.38ms
100.000%  368.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       0.659     0.100000        20391         1.11
       1.100     0.200000        40747         1.25
       2.115     0.300000        61061         1.43
       4.463     0.400000        81415         1.67
       8.607     0.500000       101757         2.00
      12.023     0.550000       111940         2.22
      15.519     0.600000       122133         2.50
      20.159     0.650000       132321         2.86
      25.263     0.700000       142481         3.33
      33.983     0.750000       152683         4.00
      37.631     0.775000       157748         4.44
      45.599     0.800000       162823         5.00
      96.959     0.825000       167902         5.71
     170.623     0.850000       173022         6.67
     210.559     0.875000       178096         8.00
     248.703     0.887500       180619         8.89
     287.487     0.900000       183176        10.00
     297.983     0.912500       185727        11.43
     303.359     0.925000       188303        13.33
     320.511     0.937500       190820        16.00
     325.887     0.943750       192137        17.78
     329.727     0.950000       193400        20.00
     331.519     0.956250       194746        22.86
     333.311     0.962500       195915        26.67
     336.383     0.968750       197210        32.00
     338.431     0.971875       197926        35.56
     339.711     0.975000       198573        40.00
     341.247     0.978125       199135        45.71
     345.087     0.981250       199707        53.33
     347.391     0.984375       200353        64.00
     351.487     0.985938       200684        71.11
     353.023     0.987500       201013        80.00
     354.559     0.989062       201401        91.43
     355.839     0.990625       201646       106.67
     356.607     0.992188       201952       128.00
     357.375     0.992969       202085       142.22
     358.911     0.993750       202267       160.00
     359.679     0.994531       202413       182.86
     360.191     0.995313       202563       213.33
     360.959     0.996094       202749       256.00
     361.215     0.996484       202850       284.44
     361.471     0.996875       202890       320.00
     361.983     0.997266       202988       365.71
     362.495     0.997656       203074       426.67
     363.263     0.998047       203120       512.00
     363.775     0.998242       203167       568.89
     364.543     0.998437       203207       640.00
     364.799     0.998633       203245       731.43
     365.311     0.998828       203278       853.33
     366.079     0.999023       203349      1024.00
     366.079     0.999121       203349      1137.78
     366.335     0.999219       203391      1280.00
     366.335     0.999316       203391      1462.86
     366.591     0.999414       203417      1706.67
     366.591     0.999512       203417      2048.00
     366.847     0.999561       203432      2275.56
     367.103     0.999609       203443      2560.00
     367.359     0.999658       203467      2925.71
     367.359     0.999707       203467      3413.33
     367.359     0.999756       203467      4096.00
     367.615     0.999780       203481      4551.11
     367.615     0.999805       203481      5120.00
     367.615     0.999829       203481      5851.43
     367.871     0.999854       203491      6826.67
     367.871     0.999878       203491      8192.00
     368.127     0.999890       203504      9102.22
     368.127     0.999902       203504     10240.00
     368.127     0.999915       203504     11702.86
     368.127     0.999927       203504     13653.33
     368.127     0.999939       203504     16384.00
     368.127     0.999945       203504     18204.44
     368.383     0.999951       203514     20480.00
     368.383     1.000000       203514          inf
#[Mean    =       56.483, StdDeviation   =      103.519]
#[Max     =      368.128, Total count    =       203514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299973 requests in 30.00s, 19.45MB read
Requests/sec:   9999.18
Transfer/sec:    664.01KB